Public Attributes | List of all members
API_AnalyticalLoadCase Struct Reference
Analytical Model
Describes a Structural Analytical Load Case. More...
#include <APIdefs_AnalyticalModel.h>
 Public Attributes
GS::UniString  | name
Name of the load case.
GS::UniString  | description
Description of the load case.
API_AnalyticalLoadCaseActionType  | actionType
Action type of the load case.
API_Guid  | loadGroupGuid
A unique identifier of the load group which contains the represented load case.
API_AnalyticalLoadCaseLoadType  | loadType
Load type of the load case.
GS::Optional< API_AnalyticalLoadCaseDuration >  | duration
Duration of the load case.
API_Guid  | loadCaseGuid
A unique identifier of the represented load case.
Detailed Description
Describes a Structural Analytical Load Case.
Since
Archicad 25
Member Data Documentation
◆ actionType
 API_AnalyticalLoadCase::actionType
Action type of the load case.
◆ description
 API_AnalyticalLoadCase::description
Description of the load case.
◆ duration
 API_AnalyticalLoadCase::duration
Duration of the load case.
◆ loadCaseGuid
 API_AnalyticalLoadCase::loadCaseGuid
A unique identifier of the represented load case.
◆ loadGroupGuid
 API_AnalyticalLoadCase::loadGroupGuid
A unique identifier of the load group which contains the represented load case.
◆ loadType
 API_AnalyticalLoadCase::loadType
Load type of the load case.
◆ name
 API_AnalyticalLoadCase::name
Name of the load case.